package Constants;

public class Constants {
    public static final String [] raz = {"BH-10","IDC-10MS","ГРПМШ2-30ГО2-В","OHП-ВГ-1-18","ГРПМ2-46ШО2-В",
                           "СНП58-16/94х9В-20","СНО63-32/95х9В-20","ППИС (РШ2Н-2)","ОНП-ВГ-1-32/46х11-В21","СНО53-60/93×9Р-23",
                           "СНП59-32/95×11Р-20-2","ГРПМ1-31ШП2-К","BH2-34 (DS1014-34, IDC2-34MS)","BH-24 (DS1013-24S, IDC-24MS)","СНО48-108/62х40В-6М-В"};

    public static final String [] ms = {"DIP16","QFP-44","SO14","SO16","SOIC14",
                          "QFP-28","TSOP24","SOT523-1-9","DIP32","SDIP32",
                          "SIP8","SOT243-1-17","ZIP-24","QFP-32","TSOP28"};

    public static final String[] headersDZ1T1 = {"Тип корпуса Разъёма","Кол-во","Тип корпуса МС","Кол-во","Коэффициент дезинтеграции","Зазор между ЭК,мм","Расстояние по торцу,мм","dпл,мм"};

    public static final String[] headersDZ3T1 = {"Тср, час", "Серия м-схем, шт.","Температура для\n" +
            "всех ЭК,","Кол-во металл-\n" + "ых отверстий, шт.","Разъем, кол-во, кол-\n" + "во контактов, шт.","Условия эксплуатации","Отн. влажность, %, высота\n" + " над уров. моря, км."};

    public static final String[] headersDZ3T2 = {"Конденсатор, шт.","Паяное соединение, шт.","Печ-ый проводник, шт.","Плата, шт.","Диоды, шт.","Переключатель, шт.","Резистор, шт.","Реле, шт."};

}
